<picture><img height="50" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/header.svg" /></picture> 

**Detailed Risks Report**
---
<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/failure.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>complete</b></h3></summary>

<details>
<summary>Terraform Log</summary>
<br>Output

```

module.vnet-hub.data.azurerm_client_config.current: Reading...
module.vnet-hub.data.azurerm_client_config.current: Read complete after 1s [id=2022-10-18 18:27:28.860375159 +0000 UTC]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vnet-hub.azurerm_firewall.fw will be created
  + resource "azurerm_firewall" "fw" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "fw-default-hub-westeurope"
      + resource_group_name = "rg-hub-demo-internal-shared-westeurope-001"
      + tags                = {
          + "BusinessUnit" = "CORP"
          + "Env"          = "dev"
          + "Owner"        = "user@example.com"
          + "ProjectName"  = "demo-internal"
          + "ResourceName" = "fw-default-hub-westeurope"
          + "ServiceClass" = "Gold"
        }
      + threat_intel_mode   = "Alert"
      + zones               = [
          + "1",
          + "2",
          + "3",
        ]

      + ip_configuration {
          + name                 = "fw-public"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.vnet-hub.azurerm_firewall_application_rule_collection.fw_app["microsoft"] will be created
  + resource "azurerm_firewall_application_rule_collection" "fw_app" {
      + action              = "Allow"
      + azure_firewall_name = "fw-default-hub-westeurope"
      + id                  = (known after apply)
      + name                = "fw-app-rule-microsoft-default-hub-westeurope"
      + priority            = 100
      + resource_group_name = "rg-hub-demo-internal-shared-westeurope-001"

      + rule {
          + name             = "microsoft"
          + source_addresses = [
              + "10.0.0.0/8",
            ]
          + target_fqdns     = [
              + "*.microsoft.com",
            ]

          + protocol {
              + port = 80
              + type = "Http"
            }
        }
    }

  # module.vnet-hub.azurerm_firewall_nat_rule_collection.fw["testrule"] will be created
  + resource "azurerm_firewall_nat_rule_collection" "fw" {
      + action              = "Dnat"
      + azure_firewall_name = "fw-default-hub-westeurope"
      + id                  = (known after apply)
      + name                = "fw-nat-rule-testrule-default-hub-westeurope"
      + priority            = 100
      + resource_group_name = "rg-hub-demo-internal-shared-westeurope-001"

      + rule {
          + destination_addresses = (known after apply)
          + destination_ports     = [
              + "53",
            ]
          + name                  = "testrule"
          + protocols             = [
              + "TCP",
              + "UDP",
            ]
          + source_addresses      = [
              + "10.0.0.0/8",
            ]
          + translated_address    = "8.8.8.8"
          + translated_port       = "53"
        }
    }

  # module.vnet-hub.azurerm_firewall_network_rule_collection.fw["ntp"] will be created
  + resource "azurerm_firewall_network_rule_collection" "fw" {
      + action              = "Allow"
      + azure_firewall_name = "fw-default-hub-westeurope"
      + id                  = (known after apply)
      + name                = "fw-net-rule-ntp-default-hub-westeurope"
      + priority            = 100
      + resource_group_name = "rg-hub-demo-internal-shared-westeurope-001"

      + rule {
          + destination_addresses = [
              + "*",
            ]
          + destination_ports     = [
              + "123",
            ]
          + name                  = "ntp"
          + protocols             = [
              + "UDP",
            ]
          + source_addresses      = [
              + "10.0.0.0/8",
            ]
        }
    }

  # module.vnet-hub.azurerm_log_analytics_workspace.logws will be created
  + resource "azurerm_log_analytics_workspace" "logws" {
      + id                   = (known after apply)
      + location             = "westeurope"
      + name                 = (known after apply)
      + portal_url           = (known after apply)
      + primary_shared_key   = (sensitive value)
      + resource_group_name  = "rg-hub-demo-internal-shared-westeurope-001"
      + retention_in_days    = 30
      + secondary_shared_key = (sensitive value)
      + sku                  = "PerGB2018"
      + tags                 = (known after apply)
      + workspace_id         = (known after apply)
    }

  # module.vnet-hub.azurerm_monitor_diagnostic_setting.fw-diag will be created
  + resource "azurerm_monitor_diagnostic_setting" "fw-diag" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = (known after apply)
      + name                       = "fw-default-hub-diag"
      + storage_account_id         = (known after apply)
      + target_resource_id         = (known after apply)

      + log {
          + category = "AzureFirewallApplicationRule"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
      + log {
          + category = "AzureFirewallDnsProxy"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
      + log {
          + category = "AzureFirewallNetworkRule"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.vnet-hub.azurerm_monitor_diagnostic_setting.nsg["dmz_subnet"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "nsg" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = (known after apply)
      + name                       = "dmz_subnet-diag"
      + storage_account_id         = (known after apply)
      + target_resource_id         = (known after apply)

      + log {
          + category = "NetworkSecurityGroupEvent"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
      + log {
          + category = "NetworkSecurityGroupRuleCounter"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.vnet-hub.azurerm_monitor_diagnostic_setting.nsg["mgnt_subnet"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "nsg" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = (known after apply)
      + name                       = "mgnt_subnet-diag"
      + storage_account_id         = (known after apply)
      + target_resource_id         = (known after apply)

      + log {
          + category = "NetworkSecurityGroupEvent"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
      + log {
          + category = "NetworkSecurityGroupRuleCounter"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.vnet-hub.azurerm_monitor_diagnostic_setting.vnet will be created
  + resource "azurerm_monitor_diagnostic_setting" "vnet" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = (known after apply)
      + name                       = "vnet-default-hub-diag"
      + storage_account_id         = (known after apply)
      + target_resource_id         = (known after apply)

      + log {
          + category = "VMProtectionAlerts"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.vnet-hub.azurerm_network_ddos_protection_plan.ddos[0] will be created
  + resource "azurerm_network_ddos_protection_plan" "ddos" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "default-hub-ddos-protection-plan"
      + resource_group_name = "rg-hub-demo-internal-shared-westeurope-001"
      + tags                = {
          + "BusinessUnit" = "CORP"
          + "Env"          = "dev"
          + "Owner"        = "user@example.com"
          + "ProjectName"  = "demo-internal"
          + "ResourceName" = "default-hub-ddos-protection-plan"
          + "ServiceClass" = "Gold"
        }
      + virtual_network_ids = (known after apply)
    }

  # module.vnet-hub.azurerm_network_security_group.nsg["dmz_subnet"] will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "nsg_dmz_subnet_in"
      + resource_group_name = "rg-hub-demo-internal-shared-westeurope-001"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = "Inbound_Port_443"
              + destination_address_prefix                 = "10.1.3.0/24"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "https"
              + priority                                   = 200
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Inbound_Port_65200-65335"
              + destination_address_prefix                 = "10.1.3.0/24"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "65200-65335"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "appgwports"
              + priority                                   = 300
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Inbound_Port_80"
              + destination_address_prefix                 = "0.0.0.0/0"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "80"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "http"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Outbound_Port_123"
              + destination_address_prefix                 = "0.0.0.0/0"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "123"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "ntp_out"
              + priority                                   = 400
              + protocol                                   = "Udp"
              + source_address_prefix                      = "10.1.3.0/24"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "BusinessUnit" = "CORP"
          + "Env"          = "dev"
          + "Owner"        = "user@example.com"
          + "ProjectName"  = "demo-internal"
          + "ResourceName" = "nsg_dmz_subnet_in"
          + "ServiceClass" = "Gold"
        }
    }

  # module.vnet-hub.azurerm_network_security_group.nsg["mgnt_subnet"] will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "nsg_mgnt_subnet_in"
      + resource_group_name = "rg-hub-demo-internal-shared-westeurope-001"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = "Inbound_Port_22"
              + destination_address_prefix                 = "10.1.2.0/24"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "ssh"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Inbound_Port_3389"
              + destination_address_prefix                 = "10.1.2.0/24"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "3389"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "rdp"
              + priority                                   = 200
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Outbound_Port_123"
              + destination_address_prefix                 = "0.0.0.0/0"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "123"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "ntp_out"
              + priority                                   = 300
              + protocol                                   = "Udp"
              + source_address_prefix                      = "10.1.2.0/24"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "BusinessUnit" = "CORP"
          + "Env"          = "dev"
          + "Owner"        = "user@example.com"
          + "ProjectName"  = "demo-internal"
          + "ResourceName" = "nsg_mgnt_subnet_in"
          + "ServiceClass" = "Gold"
        }
    }

  # module.vnet-hub.azurerm_network_watcher.nwatcher[0] will be created
  + resource "azurerm_network_watcher" "nwatcher" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "NetworkWatcher_westeurope"
      + resource_group_name = "NetworkWatcherRG"
      + tags                = {
          + "BusinessUnit" = "CORP"
          + "Env"          = "dev"
          + "Owner"        = "user@example.com"
          + "ProjectName"  = "demo-internal"
          + "ResourceName" = "NetworkWatcher_westeurope"
          + "ServiceClass" = "Gold"
        }
    }

  # module.vnet-hub.azurerm_network_watcher_flow_log.nwflog["dmz_subnet"] will be created
  + resource "azurerm_network_watcher_flow_log" "nwflog" {
      + enabled                   = true
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + network_watcher_name      = "NetworkWatcher_westeurope"
      + resource_group_name       = "NetworkWatcherRG"
      + storage_account_id        = (known after apply)
      + version                   = 2

      + retention_policy {
          + days    = 0
          + enabled = true
        }

      + traffic_analytics {
          + enabled               = true
          + interval_in_minutes   = 10
          + workspace_id          = (known after apply)
          + workspace_region      = "westeurope"
          + workspace_resource_id = (known after apply)
        }
    }

  # module.vnet-hub.azurerm_network_watcher_flow_log.nwflog["mgnt_subnet"] will be created
  + resource "azurerm_network_watcher_flow_log" "nwflog" {
      + enabled                   = true
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + network_watcher_name      = "NetworkWatcher_westeurope"
      + resource_group_name       = "NetworkWatcherRG"
      + storage_account_id        = (known after apply)
      + version                   = 2

      + retention_policy {
          + days    = 0
          + enabled = true
        }

      + traffic_analytics {
          + enabled               = true
          + interval_in_minutes   = 10
          + workspace_id          = (known after apply)
          + workspace_region      = "westeurope"
          + workspace_resource_id = (known after apply)
        }
    }

  # module.vnet-hub.azurerm_private_dns_zone.dz[0] will be created
  + resource "azurerm_private_dns_zone" "dz" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "publiccloud.example.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-hub-demo-internal-shared-westeurope-001"
      + tags                                                  = {
          + "BusinessUnit" = "CORP"
          + "Env"          = "dev"
          + "Owner"        = "user@example.com"
          + "ProjectName"  = "demo-internal"
          + "ResourceName" = "publiccloud.example.com"
          + "ServiceClass" = "Gold"
        }
    }

  # module.vnet-hub.azurerm_private_dns_zone_virtual_network_link.dzvlink[0] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "dzvlink" {
      + id                    = (known after apply)
      + name                  = "publiccloud.example.com-link"
      + private_dns_zone_name = "publiccloud.example.com"
      + registration_enabled  = false
      + resource_group_name   = "rg-hub-demo-internal-shared-westeurope-001"
      + tags                  = {
          + "BusinessUnit" = "CORP"
          + "Env"          = "dev"
          + "Owner"        = "user@example.com"
          + "ProjectName"  = "demo-internal"
          + "ResourceName" = "publiccloud.example.com-link"
          + "ServiceClass" = "Gold"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.vnet-hub.azurerm_public_ip.fw-pip["fw-public"] will be created
  + resource "azurerm_public_ip" "fw-pip" {
      + allocation_method       = "Static"
      + domain_name_label       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "pip-default-hub-fw-public-westeurope"
      + public_ip_prefix_id     = (known after apply)
      + resource_group_name     = "rg-hub-demo-internal-shared-westeurope-001"
      + sku                     = "Standard"
      + tags                    = {
          + "BusinessUnit" = "CORP"
          + "Env"          = "dev"
          + "Owner"        = "user@example.com"
          + "ProjectName"  = "demo-internal"
          + "ResourceName" = "pip-default-hub-fw-public-westeurope"
          + "ServiceClass" = "Gold"
        }
    }

  # module.vnet-hub.azurerm_public_ip_prefix.pip_prefix will be created
  + resource "azurerm_public_ip_prefix" "pip_prefix" {
      + id                  = (known after apply)
      + ip_prefix           = (known after apply)
      + location            = "westeurope"
      + name                = "default-hub-pip-prefix"
      + prefix_length       = 30
      + resource_group_name = "rg-hub-demo-internal-shared-westeurope-001"
      + sku                 = "Standard"
      + tags                = {
          + "BusinessUnit" = "CORP"
          + "Env"          = "dev"
          + "Owner"        = "user@example.com"
          + "ProjectName"  = "demo-internal"
          + "ResourceName" = "default-hub-pip-prefix"
          + "ServiceClass" = "Gold"
        }
    }

  # module.vnet-hub.azurerm_resource_group.nwatcher[0] will be created
  + resource "azurerm_resource_group" "nwatcher" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "NetworkWatcherRG"
      + tags     = {
          + "BusinessUnit" = "CORP"
          + "Env"          = "dev"
          + "Owner"        = "user@example.com"
          + "ProjectName"  = "demo-internal"
          + "ResourceName" = "NetworkWatcherRG"
          + "ServiceClass" = "Gold"
        }
    }

  # module.vnet-hub.azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg-hub-demo-internal-shared-westeurope-001"
      + tags     = {
          + "BusinessUnit" = "CORP"
          + "Env"          = "dev"
          + "Owner"        = "user@example.com"
          + "ProjectName"  = "demo-internal"
          + "ResourceName" = "rg-hub-demo-internal-shared-westeurope-001"
          + "ServiceClass" = "Gold"
        }
    }

  # module.vnet-hub.azurerm_role_assignment.dns will be created
  + resource "azurerm_role_assignment" "dns" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "aaef2f6a-d5cd-4ab1-95be-dd6109d5cca4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Private DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.vnet-hub.azurerm_role_assignment.peering will be created
  + resource "azurerm_role_assignment" "peering" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "aaef2f6a-d5cd-4ab1-95be-dd6109d5cca4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.vnet-hub.azurerm_route.rt will be created
  + resource "azurerm_route" "rt" {
      + address_prefix         = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = "route-to-firewall-default-hub-westeurope"
      + next_hop_in_ip_address = (known after apply)
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "rg-hub-demo-internal-shared-westeurope-001"
      + route_table_name       = "route-network-outbound"
    }

  # module.vnet-hub.azurerm_route_table.rtout will be created
  + resource "azurerm_route_table" "rtout" {
      + disable_bgp_route_propagation = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "route-network-outbound"
      + resource_group_name           = "rg-hub-demo-internal-shared-westeurope-001"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "BusinessUnit" = "CORP"
          + "Env"          = "dev"
          + "Owner"        = "user@example.com"
          + "ProjectName"  = "demo-internal"
          + "ResourceName" = "route-network-outbound"
          + "ServiceClass" = "Gold"
        }
    }

  # module.vnet-hub.azurerm_storage_account.storeacc will be created
  + resource "azurerm_storage_account" "storeacc" {
      + access_tier                      = (known after apply)
      + account_kind                     = "StorageV2"
      + account_replication_type         = "GRS"
      + account_tier                     = "Standard"
      + allow_blob_public_access         = false
      + enable_https_traffic_only        = true
      + id                               = (known after apply)
      + is_hns_enabled                   = false
      + location                         = "westeurope"
      + min_tls_version                  = "TLS1_0"
      + name                             = "stdiaglogsdefaulthub"
      + primary_access_key               = (sensitive value)
      + primary_blob_connection_string   = (sensitive value)
      + primary_blob_endpoint            = (known after apply)
      + primary_blob_host                = (known after apply)
      + primary_connection_string        = (sensitive value)
      + primary_dfs_endpoint             = (known after apply)
      + primary_dfs_host                 = (known after apply)
      + primary_file_endpoint            = (known after apply)
      + primary_file_host                = (known after apply)
      + primary_location                 = (known after apply)
      + primary_queue_endpoint           = (known after apply)
      + primary_queue_host               = (known after apply)
      + primary_table_endpoint           = (known after apply)
      + primary_table_host               = (known after apply)
      + primary_web_endpoint             = (known after apply)
      + primary_web_host                 = (known after apply)
      + resource_group_name              = "rg-hub-demo-internal-shared-westeurope-001"
      + secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      + secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)
      + tags                             = {
          + "BusinessUnit" = "CORP"
          + "Env"          = "dev"
          + "Owner"        = "user@example.com"
          + "ProjectName"  = "demo-internal"
          + "ResourceName" = "stdiaglogsdefaulthub"
          + "ServiceClass" = "Gold"
        }

      + blob_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }
    }

  # module.vnet-hub.azurerm_subnet.fw-snet will be created
  + resource "azurerm_subnet" "fw-snet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.1.0.0/26",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "AzureFirewallSubnet"
      + resource_group_name                            = "rg-hub-demo-internal-shared-westeurope-001"
      + service_endpoints                              = [
          + "Microsoft.AzureActiveDirectory",
          + "Microsoft.AzureCosmosDB",
          + "Microsoft.EventHub",
          + "Microsoft.KeyVault",
          + "Microsoft.ServiceBus",
          + "Microsoft.Sql",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "vnet-default-hub-westeurope"
    }

  # module.vnet-hub.azurerm_subnet.gw_snet[0] will be created
  + resource "azurerm_subnet" "gw_snet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.1.1.0/27",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "GatewaySubnet"
      + resource_group_name                            = "rg-hub-demo-internal-shared-westeurope-001"
      + service_endpoints                              = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "vnet-default-hub-westeurope"
    }

  # module.vnet-hub.azurerm_subnet.snet["dmz_subnet"] will be created
  + resource "azurerm_subnet" "snet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.1.3.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "snet-appgateway-default-hub-westeurope"
      + resource_group_name                            = "rg-hub-demo-internal-shared-westeurope-001"
      + service_endpoints                              = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "vnet-default-hub-westeurope"
    }

  # module.vnet-hub.azurerm_subnet.snet["mgnt_subnet"] will be created
  + resource "azurerm_subnet" "snet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.1.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "snet-management-default-hub-westeurope"
      + resource_group_name                            = "rg-hub-demo-internal-shared-westeurope-001"
      + service_endpoints                              = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "vnet-default-hub-westeurope"
    }

  # module.vnet-hub.azurerm_subnet_network_security_group_association.nsg-assoc["dmz_subnet"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg-assoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.vnet-hub.azurerm_subnet_network_security_group_association.nsg-assoc["mgnt_subnet"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg-assoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.vnet-hub.azurerm_subnet_route_table_association.rtassoc["dmz_subnet"] will be created
  + resource "azurerm_subnet_route_table_association" "rtassoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vnet-hub.azurerm_subnet_route_table_association.rtassoc["mgnt_subnet"] will be created
  + resource "azurerm_subnet_route_table_association" "rtassoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vnet-hub.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "vnet-default-hub-westeurope"
      + resource_group_name = "rg-hub-demo-internal-shared-westeurope-001"
      + subnet              = (known after apply)
      + tags                = {
          + "BusinessUnit" = "CORP"
          + "Env"          = "dev"
          + "Owner"        = "user@example.com"
          + "ProjectName"  = "demo-internal"
          + "ResourceName" = "vnet-default-hub-westeurope"
          + "ServiceClass" = "Gold"
        }

      + ddos_protection_plan {
          + enable = true
          + id     = (known after apply)
        }
    }

  # module.vnet-hub.random_string.main will be created
  + resource "random_string" "main" {
      + id          = (known after apply)
      + keepers     = {
          + "name" = "default-hub"
        }
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.vnet-hub.random_string.str["fw-public"] will be created
  + resource "random_string" "str" {
      + id          = (known after apply)
      + keepers     = {
          + "domain_name_label" = "fw-public"
        }
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 37 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ddos_protection_plan_id              = (known after apply)
  + firewall_id                          = (known after apply)
  + firewall_name                        = "fw-default-hub-westeurope"
  + firewall_private_ip                  = (known after apply)
  + firewall_public_ip                   = (known after apply)
  + firewall_public_ip_fqdn              = (known after apply)
  + log_analytics_customer_id            = (known after apply)
  + log_analytics_logs_retention_in_days = 30
  + log_analytics_workspace_id           = (known after apply)
  + log_analytics_workspace_name         = (known after apply)
  + network_security_group_ids           = [
      + (known after apply),
      + (known after apply),
    ]
  + network_watcher_id                   = (known after apply)
  + private_dns_zone_id                  = (known after apply)
  + private_dns_zone_name                = "publiccloud.example.com"
  + public_ip_prefix_id                  = (known after apply)
  + resource_group_id                    = (known after apply)
  + resource_group_location              = "westeurope"
  + resource_group_name                  = "rg-hub-demo-internal-shared-westeurope-001"
  + route_table_id                       = (known after apply)
  + route_table_name                     = "route-network-outbound"
  + storage_account_id                   = (known after apply)
  + storage_account_name                 = "stdiaglogsdefaulthub"
  + storage_primary_access_key           = (sensitive value)
  + subnet_address_prefixes              = [
      + (known after apply),
      + (known after apply),
      + "10.1.1.0/27",
      + "10.1.0.0/26",
    ]
  + subnet_ids                           = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + virtual_network_address_space        = [
      + "10.1.0.0/16",
    ]
  + virtual_network_id                   = (known after apply)
  + virtual_network_name                 = "vnet-default-hub-westeurope"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/src/terraform/examples/complete\tmp\complete.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/src/terraform/examples/complete\\tmp\\complete.out"


```
<br>

</details> <!-- End Format Logs -->


<details>
<summary>Analysis Log</summary>
<br>Errors

```

"Missing supported products in tf file"

```
<br>
</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/failure.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>terraform</b></h3></summary>

<details>
<summary>Terraform Log</summary>

<br>Errors

```

Command 'terraform' failed with args 'plan -input=false -no-color -out=/home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/src/terraform\tmp\terraform.out': 
Error: "name" may only contain alphanumeric characters, dash, underscores, parentheses and periods

  with azurerm_resource_group.rg[0],
  on main.tf line 37, in resource "azurerm_resource_group" "rg":
  37: resource "azurerm_resource_group" "rg" {


Error: "location" must not be empty

  with azurerm_resource_group.rg[0],
  on main.tf line 37, in resource "azurerm_resource_group" "rg":
  37: resource "azurerm_resource_group" "rg" {

: Error: The process '/usr/local/bin/terraform' failed with exit code 1

```
<br>
</details> <!-- End Format Logs -->


</details>

---


<br>
Pusher: @Artsemil<br>
Action: pull_request<br>
Workflow: Test Repo CI/CD